cf/InformationRegisters/БумажныеДокументы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>БумажныеДокументы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПервичныйДокумент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПервичныйПослеКорректировки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БылаКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаКорректировки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.РегистрацияБумажныхДокументов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/InformationRegisters/БумажныеДокументы/Ext/ManagerModule.bsl
Функция УстановитьГалки(Ссылки, Первичный = Неопределено, КорректировкаПервичного = Неопределено, Примечание = Неопределено) Экспорт
	
	НачатьТранзакцию();
	
	Для Каждого Ссылка Из Ссылки Цикл
		
		Записывать = Ложь;
		
		Запись = СоздатьМенеджерЗаписи();
		Запись.Документ = Ссылка;
		Запись.Прочитать();
		
		Запись.Документ = Ссылка;
		Запись.Ответственный = ПараметрыСеанса.ТекущийПользователь;
		
		Если Первичный <> Неопределено Тогда 				Запись.ПервичныйДокумент = Первичный; Записывать = Истина; КонецЕсли;
		Если КорректировкаПервичного <> Неопределено Тогда 	Запись.ПервичныйПослеКорректировки = КорректировкаПервичного; Записывать = Истина; КонецЕсли;
		Если КорректировкаПервичного = Истина Тогда			Запись.БылаКорректировка = Ложь; Записывать = Истина; КонецЕсли;
		Если Примечание <> Неопределено Тогда				Запись.Примечание = Примечание; Записывать = Истина; КонецЕсли;
		
		Если Записывать И Не ОбщиеФункции.ЗаписатьОбъектИСообщитьЕслиОшибка(Запись) Тогда
			ОтменитьТранзакцию();
			Возврат Ложь; КонецЕсли; КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	
	Возврат Истина;
	
КонецФункции
